Repository: neokapi/neokapi
Catalog: l10n/tm/builtins-nb.tmx
Source language: en
Languages: nb

source: Script Source
nb: Skriptkilde

source: Script source mode
nb: Skriptkildemodus

source: Search and Replace
nb: Søk og erstatt

source: Segment Count
nb: Segmenttelling

source: Segment Source Text
nb: Segmenter kildetekst

source: Segment Target Text
nb: Segmenter måltekst

source: Segment existing target text
nb: Segmenter eksisterende måltekst

source: Segment the source text
nb: Segmenter kildeteksten

source: Segmentation
nb: Segmentering

source: Segmentation Engine
nb: Segmenteringsmotor

source: Segmentation overlay layer name; empty uses the engine's natural layer
nb: Navn på segmenteringsoverleggslaget; tomt bruker motorens naturlige lag

source: Segmenter backend: srx (rule-based; default)/ uax29 (Unicode baseline)/ llm (semantic chunks)/ sat (ML model)
nb: Segmenteringsmotor: srx (regelbasert; standard)/ uax29 (Unicode-grunnlinje)/ llm (semantiske biter)/ sat (ML-modell)

source: Semicolon-separated list of words allowed to repeat (e.g. sie;vous;nous)
nb: Semikolonseparert liste over ord som kan gjentas (f.eks. sie;vous;nous)

source: Separator
nb: Skilletegn

source: Settings that control how the HTML parser reads input
nb: Innstillinger som styrer hvordan HTML-parseren leser inndata

source: Sheet names to exclude from extraction.
nb: Arknavn som skal ekskluderes fra uttrekket.

source: Short/Long Threshold (Max)
nb: Terskel for kort/lang (maks)

source: Short/Long Threshold (Min)
nb: Terskel for kort/lang (min)

source: Size unit for maxwidth.
nb: Størrelsesenhet for maksbredde.

source: Skip Matched
nb: Hopp over oversatte

source: Skip TM query if existing candidate scores at or above this value (101 = always query)
nb: Hopp over TM-spørring hvis en eksisterende kandidat har poengsum på eller over denne verdien (101 = spør alltid)

source: Skip blocks that already have a target translation
nb: Hopp over blokker som allerede har en måloversettelse

source: Skip name-reference entries
nb: Hopp over navnereferanser

source: Skip resource references
nb: Hopp over ressursreferanser

source: Skip translatable="false" entries
nb: Hopp over oppføringer med translatable="false"

source: Source SRX Rules Path
nb: Sti til SRX-regler for kilde

source: Spliced Lines
nb: Skjøtte linjer

source: Split words at character limit
nb: Del ord ved tegngrensen

source: Split words so that they don't go over the character limit per line.
nb: Del ord slik at de ikke overskrider tegngrensen per linje.

source: State for new translations
nb: State for nye oversettelser

source: State value to set on target elements when useTranslationTargetState is enabled
nb: State-verdi som settes på target-elementer når useTranslationTargetState er aktivert

source: Stop processing when encountering invalid TUs. When false, invalid TUs are skipped.
nb: Stopp behandlingen ved ugyldige TU-er. Når false, hoppes ugyldige TU-er over.

source: Stored credential name for the llm engine
nb: Navn på lagret legitimasjon for llm-motoren

source: Strip revision IDs, proofing errors, and other noise before merging runs.
nb: Fjern revisjons-ID-er, korrekturfeil og annen støy før runs flettes.

source: Sub-filter rules
nb: Underfilterregler

source: Sub-filter to apply to scalar values (e.g., 'html' to process HTML within YAML values)
nb: Underfilter som brukes på skalarverdier (f.eks. 'html' for å behandle HTML i YAML-verdier)

source: Subfilter Format
nb: Underfilterformat

source: Subfilter HTML values (_html keys)
nb: Underfilter for HTML-verdier (_html-nøkler)

source: Subfilter format
nb: Underfilterformat

source: Subfilter format to apply to HTML content within Markdown (e.g., 'html')
nb: Underfilterformat som brukes på HTML-innhold i Markdown (f.eks. 'html')

source: Subfilter mappings
nb: Underfiltertilordninger

source: Subfilters
nb: Underfiltre

source: Subject domain for terminology extraction (e.g. medical legal technology)
nb: Fagdomene for terminologiuttrekk (f.eks. medical legal technology)

source: Subscription Key
nb: Abonnementsnøkkel

source: Suffix
nb: Suffiks

source: Support Backslash Escaping
nb: Støtt escaping med omvendt skråstrek

source: Surface a /* ... */ or // ... comment preceding a .strings entry as a translator note on the emitted block.
nb: Vis en /* ... */- eller // ...-kommentar foran en .strings-oppføring som oversettermerknad på den utsendte blokken.

source: Surface an XML comment immediately preceding an entry as a translator note on the emitted block. Comments always round-trip verbatim regardless of this setting.
nb: Vis en XML-kommentar rett foran en oppføring som oversettermerknad på den utsendte blokken. Kommentarer bevares alltid uendret ved rundtur uavhengig av denne innstillingen.

source: Surface descriptions as notes
nb: Vis beskrivelser som merknader

source: Surface each string <data> entry's sibling <comment> element as a translator note on the emitted block. Comments always round-trip verbatim regardless of this setting.
nb: Vis <comment>-elementet som hører til hver <data>-strengoppføring, som oversettermerknad på den utsendte blokken. Kommentarer bevares alltid uendret ved rundtur uavhengig av denne innstillingen.

source: Surface the "description" field of a resource's sibling "@<id>" attributes object as a translator note. The attributes object is always preserved byte-faithfully on round-trip regardless of this setting.
nb: Vis "description"-feltet i ressursens tilhørende "@<id>"-attributtobjekt som oversettermerknad. Attributtobjektet bevares alltid byte-tro ved rundtur uavhengig av denne innstillingen.

source: TM Leverage
nb: TM-gjenbruk

source: TMX Output Path
nb: TMX-utdatasti

source: TTML Subtitles
nb: TTML-undertekster

source: Take case differences into account when comparing
nb: Ta hensyn til forskjeller i store/små bokstaver ved sammenligning

source: Take punctuation differences into account when comparing
nb: Ta hensyn til tegnsettingsforskjeller ved sammenligning

source: Take whitespace differences into account when comparing
nb: Ta hensyn til blanktegnforskjeller ved sammenligning

source: Target SRX Rules Path
nb: Sti til SRX-regler for mål

source: Target XLIFF 2.x version to emit. Empty means: preserve the input document version on roundtrip, otherwise default to 2.2.
nb: XLIFF 2.x-versjon som skal skrives ut. Tom betyr: bevar inndatadokumentets versjon ved rundtur, ellers brukes 2.2 som standard.

source: Target state value
nb: State-verdi for mål

source: Terminology Check
nb: Terminologikontroll

source: Terms to exclude from extraction (already in termbase)
nb: Termer som skal ekskluderes fra uttrekket (allerede i termbase)

source: Text Qualifier
nb: Tekstkvalifikator

source: The stringUnit state value written for a localization populated for the first time. Existing states are preserved verbatim on round-trip.
nb: stringUnit-state-verdien som skrives for en lokalisering som fylles ut for første gang. Eksisterende state-verdier bevares uendret ved rundtur.

source: Transformation Mode
nb: Transformasjonsmodus

source: Translatable Columns
nb: Oversettbare kolonner

source: Translatable attributes
nb: Oversettbare attributter

source: Translatable elements
nb: Oversettbare elementer

source: Translate Block Quotes
nb: Oversett sitatblokker

source: Translate Code Blocks
nb: Oversett kodeblokker

source: Translate HTML Blocks
nb: Oversett HTML-blokker

source: Translate Hyperlink URLs
nb: Oversett hyperkoblings-URL-er

source: Translate Image Alt Text
nb: Oversett alt-tekst for bilder

source: Translate YAML Front Matter
nb: Oversett YAML-frontmatter

source: Translate chart text
nb: Oversett diagramtekst

source: Translate comments
nb: Oversett kommentarer

source: Translate content using DeepL
nb: Oversett innhold med DeepL

source: Translate content using Google Translate
nb: Oversett innhold med Google Translate

source: Translate content using Microsoft Translator
nb: Oversett innhold med Microsoft Translator

source: Translate content using ModernMT
nb: Oversett innhold med ModernMT

source: Translate content using MyMemory
nb: Oversett innhold med MyMemory

source: Translate content using an LLM provider
nb: Oversett innhold med en LLM-leverandør

source: Translate diagram data
nb: Oversett diagramdata

source: Translate document properties
nb: Oversett dokumentegenskaper

source: Translate footnotes and endnotes
nb: Oversett fotnoter og sluttnoter

source: Translate headers and footers
nb: Oversett topptekst og bunntekst

source: Translate hidden slides
nb: Oversett skjulte lysbilder

source: Translate hidden text
nb: Oversett skjult tekst

source: Translate master slides
nb: Oversett lysbildemaler

source: Translate shared strings
nb: Oversett delte strenger

source: Translate sheet names
nb: Oversett arknavn

source: Translate slide notes
nb: Oversett lysbildenotater

source: Translation Comparison
nb: Oversettelsessammenligning

source: Translation Table
nb: Oversettelsestabell

source: Treat Isolated Codes as Whitespace
nb: Behandle isolerte koder som blanktegn

source: Treat all content as xml:space="preserve" unless explicitly overridden
nb: Behandle alt innhold som xml:space="preserve" med mindre det overstyres eksplisitt

source: Treat comments as translator notes attached to the following entry
nb: Behandle kommentarer som oversettermerknader knyttet til den påfølgende oppføringen

source: Treat isolated inline codes as whitespace during segmentation
nb: Behandle isolerte inline-koder som blanktegn under segmentering

source: Treat tab elements as tab characters instead of placeholder spans.
nb: Behandle tabulatorelementer som tabulatortegn i stedet for plassholder-spenn.

source: Trim Leading Whitespace
nb: Fjern innledende blanktegn

source: Trim Trailing Whitespace
nb: Fjern avsluttende blanktegn

source: Trim Values
nb: Trim verdier

source: Unredact
nb: Avsladding

source: Update target state attribute
nb: Oppdater state-attributtet på mål

source: Update the state attribute on target elements when writing translated XLIFF
nb: Oppdater state-attributtet på target-elementer når oversatt XLIFF skrives

source: Use Generic Codes
nb: Bruk generiske koder

source: Use JSON key as the Block (TextUnit) name for reference.
nb: Bruk JSON-nøkkelen som navn på blokken (TextUnit) for referanse.

source: Use Regular Expressions
nb: Bruk regulære uttrykk

source: Use full path (/key1/key2) instead of immediate key as name.
nb: Bruk full sti (/key1/key2) i stedet for nærmeste nøkkel som navn.

source: Use generic numbered tags (e.g. <1>...</1>) instead of original inline codes in reports
nb: Bruk generiske nummererte tagger (f.eks. <1>...</1>) i stedet for originale inline-koder i rapporter

source: Use localization directives
nb: Bruk lokaliseringsdirektiver

source: Use the full key path
nb: Bruk hele nøkkelstien

source: Use the full path of IDs for resname
nb: Bruk hele ID-stien for resname

source: Use the key as the resname
nb: Bruk nøkkelen som resname

source: Use the trans-unit id attribute as the block name when no resname attribute is present
nb: Bruk id-attributtet på trans-unit som blokknavn når resname-attributtet mangler

source: Use trans-unit ID as name if no resname
nb: Bruk trans-unit-ID som navn hvis resname mangler

source: Values Start Row
nb: Startrad for verdier

source: Verify Terminology
nb: Verifiser terminologi

source: Verify that source patterns have expected corresponding content in the target
nb: Verifiser at kildemønstre har forventet tilsvarende innhold i målet

source: Verify that target segments have the same inline codes as source segments
nb: Verifiser at målsegmenter har de samme inline-kodene som kildesegmentene

source: Versified Text
nb: Versinndelt tekst

source: Vignette CMS Export
nb: Vignette CMS-eksport

source: Visible stand-in template; supports {category} and {n}
nb: Synlig plassholdermal; støtter {category} og {n}

source: Warn if a character is not included in the specified character set encoding
nb: Varsle hvis et tegn ikke finnes i den angitte tegnsettkodingen

source: Warn if target exceeds a percentage of source character length
nb: Varsle hvis målet overskrider en prosentandel av kildens tegnlengde

source: Warn if target is shorter than a percentage of source character length
nb: Varsle hvis målet er kortere enn en prosentandel av kildens tegnlengde

source: Warn on Doubled Words
nb: Varsle om gjentatte ord

source: Warn on Empty Target
nb: Varsle om tomt mål

source: Warn on Non-Empty Target with Empty Source
nb: Varsle om ikke-tomt mål med tom kilde

source: Warn on Target Same as Source
nb: Varsle når mål er lik kilde

source: When enabled, extract only entries whose keys match the condition; otherwise exclude matching keys
nb: Når aktivert, trekkes bare oppføringer med nøkler som matcher betingelsen ut; ellers ekskluderes matchende nøkler

source: When non-empty, only keys matching one of these glob patterns are extracted. Supports * (single key) and ** (any depth).
nb: Når ikke tom, trekkes bare nøkler som matcher ett av disse glob-mønstrene ut. Støtter * (én nøkkel) og ** (vilkårlig dybde).

source: When true, <br/> elements are removed and text is joined with spaces; when false, <br/> is preserved as literal text.
nb: Når true, fjernes <br/>-elementer og teksten settes sammen med mellomrom; når false, bevares <br/> som bokstavelig tekst.

source: Whether comparison is case-sensitive
nb: Om sammenligningen skiller mellom store og små bokstaver

source: Whether term matching is case-sensitive
nb: Om termmatching skiller mellom store og små bokstaver

source: Whitespace Sensitive
nb: Blanktegnfølsom

source: Wiki markup variant: mediawiki or dokuwiki. Default is dokuwiki to match the okf_wiki bridge contract.
nb: Wikioppmerkingsvariant: mediawiki eller dokuwiki. Standard er dokuwiki for å samsvare med okf_wiki-brokontrakten.

source: Word Count
nb: Ordtelling

source: Wrap Long Content Lines
nb: Bryt lange innholdslinjer

source: Wrap long content lines in output at approximately 80 characters
nb: Bryt lange innholdslinjer i utdata ved omtrent 80 tegn

source: XLIFF version
nb: XLIFF-versjon

source: file
nb: fil

source: generic
nb: generisk

source: llm (AI provider; default) / ner (local on-device model — nothing leaves the machine) / hybrid (both)
nb: llm (AI-leverandør; standard) / ner (lokal modell på enheten — ingenting forlater maskinen) / hybrid (begge)

source: lower
nb: små bokstaver

source: plain
nb: ren tekst

source: title
nb: stor forbokstav

source: upper
nb: store bokstaver
